OpenDTEF-v2012/tutorials/verificationAndValidation/atmosphericModels/HargreavesWright_2007/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.0007;

boundaryField
{
    #include            "include/ABLConditions"

    inlet
    {
        type            atmBoundaryLayerInletOmega;
        #include        "include/ABLConditions"
        value           uniform 0;
    }

    ground
    {
        type            omegaWallFunction;
        Cmu             $Cmu;
        kappa           $kappa;
        value           $internalField;
    }

    top
    {
        type            zeroGradient;
    }

    sides
    {
        type            symmetry;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
}


// ************************************************************************* //
